In [1]:
import pandas as pd

# Sample data
mydataset = {
    'StudentID': [1, 2, 3, 4, 5],
    'Name': ['John Doe', 'Jane Smith', 'Michael Johnson', 'Emily Davis', 'David Brown'],
    'Age': [20, 19, 21, 20, 22],
    'Grade': ['A', 'B', 'B', 'A', 'C']
}

# Convert to DataFrame
df = pd.DataFrame(mydataset)

# Display the DataFrame
print("Original DataFrame:")
print(df)
print()

# Accessing columns
print("Accessing columns:")
print(df['Name'])  # Access a single column by name
print(df[['Name', 'Age']])  # Access multiple columns by name
print()

# Accessing rows
print("Accessing rows:")
print(df.loc[2])  # Access a single row by index label using .loc
print(df.loc[1:3])  # Access multiple rows by index labels using .loc
print(df.iloc[2])  # Access a single row by index position using .iloc
print(df.iloc[1:3])  # Access multiple rows by index positions using .iloc
print()

# Accessing elements
print("Accessing elements:")
print(df.at[1, 'Name'])  # Access a single element by row index and column name using .at
print(df.iat[2, 2])  # Access a single element by row index and column index using .iat
print()

# Filtering data
print("Filtering data:")
print(df[df['Age'] > 20])  # Filter rows based on a condition
print(df[(df['Age'] > 20) & (df['Grade'] == 'B')])  # Filter rows based on multiple conditions
print()

# Adding a new column
df['Gender'] = ['M', 'F', 'M', 'F', 'M']  # Add a new column
print("DataFrame with added column:")
print(df)
print()

# Updating values
df.loc[3, 'Age'] = 22  # Update a single value
df.loc[df['Grade'] == 'B', 'Grade'] = 'A'  # Update values based on a condition
print("DataFrame after updating values:")
print(df)
print()

# Deleting columns
df.drop('Grade', axis=1, inplace=True)  # Delete a single column
print("DataFrame after deleting 'Grade' column:")
print(df)
print()

# Deleting rows
df.drop([0, 1], inplace=True)  # Delete multiple rows
print("DataFrame after deleting rows:")
print(df)

Original DataFrame:
   StudentID             Name  Age Grade
0          1         John Doe   20     A
1          2       Jane Smith   19     B
2          3  Michael Johnson   21     B
3          4      Emily Davis   20     A
4          5      David Brown   22     C

Accessing columns:
0           John Doe
1         Jane Smith
2    Michael Johnson
3        Emily Davis
4        David Brown
Name: Name, dtype: object
              Name  Age
0         John Doe   20
1       Jane Smith   19
2  Michael Johnson   21
3      Emily Davis   20
4      David Brown   22

Accessing rows:
StudentID                  3
Name         Michael Johnson
Age                       21
Grade                      B
Name: 2, dtype: object
   StudentID             Name  Age Grade
1          2       Jane Smith   19     B
2          3  Michael Johnson   21     B
3          4      Emily Davis   20     A
StudentID                  3
Name         Michael Johnson
Age                       21
Grade                      B
Name: 2, dtype: object
   StudentID             Name  Age Grade
1          2       Jane Smith   19     B
2          3  Michael Johnson   21     B

Accessing elements:
Jane Smith
21

Filtering data:
   StudentID             Name  Age Grade
2          3  Michael Johnson   21     B
4          5      David Brown   22     C
   StudentID             Name  Age Grade
2          3  Michael Johnson   21     B

DataFrame with added column:
   StudentID             Name  Age Grade Gender
0          1         John Doe   20     A      M
1          2       Jane Smith   19     B      F
2          3  Michael Johnson   21     B      M
3          4      Emily Davis   20     A      F
4          5      David Brown   22     C      M

DataFrame after updating values:
   StudentID             Name  Age Grade Gender
0          1         John Doe   20     A      M
1          2       Jane Smith   19     A      F
2          3  Michael Johnson   21     A      M
3          4      Emily Davis   22     A      F
4          5      David Brown   22     C      M

DataFrame after deleting 'Grade' column:
   StudentID             Name  Age Gender
0          1         John Doe   20      M
1          2       Jane Smith   19      F
2          3  Michael Johnson   21      M
3          4      Emily Davis   22      F
4          5      David Brown   22      M

DataFrame after deleting rows:
   StudentID             Name  Age Gender
2          3  Michael Johnson   21      M
3          4      Emily Davis   22      F
4          5      David Brown   22      M

In [2]:
df['Name'].iloc[1]

'Emily Davis'

In [3]:
# Create a simple pandas series from a dictionary: For days and dates
import pandas as pd

data = {'Monday': '2023-07-01', 'Tuesday': '2023-07-02', 'Wednesday': '2023-07-03', 'Thursday': '2023-07-04'}

series = pd.Series(data)
print(series)

Monday       2023-07-01
Tuesday      2023-07-02
Wednesday    2023-07-03
Thursday     2023-07-04
dtype: object

In [4]:
# Filter the dictionary to include only Monday and Tuesday
filtered_data = {key: value for key, value in data.items() if key in ['Monday', 'Tuesday']}

# Create a Pandas Series from the filtered dictionary
new_series = pd.Series(filtered_data)

# Print the series
print(new_series)

Monday     2023-07-01
Tuesday    2023-07-02
dtype: object

In [5]:
#Exercise using the mine
import pandas as pd
df = pd.read_csv("mine.csv")
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [6]:
# Applying the head() function on display the first five rows
df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [7]:
# Applying the head() function on display the last five rows
df.tail()

     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [8]:
# Applying the info() to display information about the DataFrame, 
# including the column names, data types, and non-null counts.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [9]:
# Trying to examine the columns with null values 
df.isnull().sum().sort_values(ascending=False)

Calories    5
Duration    0
Pulse       0
Maxpulse    0
dtype: int64

In [10]:
# Display the DataFrame with only null value records
null_records = df[df.isnull().any(axis=1)]
print("DataFrame with only null value records:")
print(null_records)

DataFrame with only null value records:
     Duration  Pulse  Maxpulse  Calories
17         45     90       112       NaN
27         60    103       132       NaN
91         45    107       137       NaN
118        60    105       125       NaN
141        60     97       127       NaN

In [11]:
# Making a copy of the dataframe to demonstrate dropping null values and filling
# null values accordingly
df_copy1 = df.copy()
df_copy2 = df.copy()

In [12]:
# Dropna() - Drop rows with missing values
df_dropna = df_copy1.dropna()
print("DataFrame after dropping rows with missing values:")
print(df_dropna)

DataFrame after dropping rows with missing values:
     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

In [13]:
# Fillna() - Fill missing values with a specific value or strategy

# Calculate the mean value from non-null 'Calories' values
calories_mean = df_copy2['Calories'].mean()

# Fill the null values in 'Calories' column with the calculated mean
df_copy2['Calories'].fillna(calories_mean, inplace=True)
print("DataFrame after filling missing values:")
print(df_copy2)
print()

null_records = df_copy2[df_copy2.isnull().any(axis=1)]
print("DataFrame with only null value records after filling missing values:")
print(null_records)

DataFrame after filling missing values:
     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

DataFrame with only null value records after filling missing values:
Empty DataFrame
Columns: [Duration, Pulse, Maxpulse, Calories]
Index: []

In [14]:
df_copy2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  169 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [15]:
# Changing Calories from float to int ie changing data formats
df_copy2['Calories'] = df_copy2['Calories'].astype(int)
df_copy2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  169 non-null    int32
dtypes: int32(1), int64(3)
memory usage: 4.7 KB

In [16]:
# Remove duplicate rows
df_copy2 = df_copy2.drop_duplicates()
df_copy2 # Number of rows reduces

     Duration  Pulse  Maxpulse  Calories
0          60    110       130       409
1          60    117       145       479
2          60    103       135       340
3          45    109       175       282
4          45    117       148       406
..        ...    ...       ...       ...
164        60    105       140       290
165        60    110       145       300
166        60    115       145       310
167        75    120       150       320
168        75    125       150       330

[159 rows x 4 columns]

In [17]:
# Calculate correlation matrix
correlation_matrix = df_copy2.corr()

# Print the cleaned DataFrame and correlation matrix
print("Cleaned DataFrame:")
print(df_copy2)
print("\nCorrelation Matrix:")
print(correlation_matrix)

Cleaned DataFrame:
     Duration  Pulse  Maxpulse  Calories
0          60    110       130       409
1          60    117       145       479
2          60    103       135       340
3          45    109       175       282
4          45    117       148       406
..        ...    ...       ...       ...
164        60    105       140       290
165        60    110       145       300
166        60    115       145       310
167        75    120       150       320
168        75    125       150       330

[159 rows x 4 columns]

Correlation Matrix:
          Duration     Pulse  Maxpulse  Calories
Duration  1.000000 -0.155552  0.013389  0.924054
Pulse    -0.155552  1.000000  0.785231  0.018924
Maxpulse  0.013389  0.785231  1.000000  0.201674
Calories  0.924054  0.018924  0.201674  1.000000

In [18]:
#Exercise using the Work.csv
import pandas as pd
df2 = pd.read_csv("Work.csv")
df2

     Name         city    age py-score
0    Emma      Kampala     23       90
1  Wilber        Mbale     26       75
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

In [19]:
# Applying the head() function on display the first five rows
df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [20]:
# Applying the head() function on display the last five rows
df2.tail()

     Name         city    age py-score
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

In [21]:
# Applying the info() to display information about the DataFrame, 
# including the column names, data types, and non-null counts.
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      7 non-null      object
 1   city      7 non-null      object
 2   age       6 non-null      object
 3   py-score  6 non-null      object
dtypes: object(4)
memory usage: 352.0+ bytes

In [22]:
# Trying to examine the columns with null values 
df2.isnull().sum().sort_values(ascending=False)

age         1
py-score    1
Name        0
city        0
dtype: int64

In [23]:
# Display the DataFrame with only null value records
null_records = df2[df2.isnull().any(axis=1)]
print("DataFrame with only null value records:")
print(null_records)

DataFrame with only null value records:
     Name         city    age py-score
3   Tevor  Livingstone    NaN       89
5  Miriam         Arua  Train      NaN

In [24]:
# Making a copy of the dataframe to demonstrate dropping null values and filling
# null values accordingly
df2_copy1 = df2.copy()
df2_copy2 = df2.copy()

In [25]:
# Dropna() - Drop rows with missing values
df2_dropna = df2_copy1.dropna()
print("DataFrame after dropping rows with missing values:")
print(df2_dropna)

DataFrame after dropping rows with missing values:
     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
2   Robin     Gulu  25     mine
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

In [26]:
# Fillna() - Fill missing values with a specific value or strategy

# converts the 'py-score' and 'age' column in df2_copy2 to a numeric data type, 
# ensuring that any non-numeric values are replaced with NaN
numeric_scores = pd.to_numeric(df2_copy2['py-score'], errors='coerce')
numeric_age = pd.to_numeric(df2_copy2['age'], errors='coerce')

# Getting mean age and py-score
mean_score = numeric_scores.mean()
mean_age = numeric_age.mean()

# Filling null values with appropriate values and converting to int data type
df2_copy2['py-score'] = numeric_scores.fillna(mean_score)
df2_copy2['py-score'] = df2_copy2['py-score'].astype(int)

df2_copy2['age'] = numeric_age.fillna(mean_age)
df2_copy2['age'] = df2_copy2['age'].astype(int)

print(df2_copy2)

     Name         city  age  py-score
0    Emma      Kampala   23        90
1  Wilber        Mbale   26        75
2   Robin         Gulu   25        86
3   Tevor  Livingstone   23        89
4    Yeko       Tororo   20        94
5  Miriam         Arua   23        86
6   Jesca      Mbarara   21        84

In [27]:
# Remove duplicate rows
df2_copy2 = df2_copy2.drop_duplicates()
df2_copy2 # number of rows remains the same hence no duplicate rows

     Name         city  age  py-score
0    Emma      Kampala   23        90
1  Wilber        Mbale   26        75
2   Robin         Gulu   25        86
3   Tevor  Livingstone   23        89
4    Yeko       Tororo   20        94
5  Miriam         Arua   23        86
6   Jesca      Mbarara   21        84

In [28]:
# Correlation: finding the correlation between age and py-score
correlation = df2_copy2[['age', 'py-score']].corr()
print("Correlation between age and py-score:")
print(correlation)

Correlation between age and py-score:
              age  py-score
age       1.00000  -0.71148
py-score -0.71148   1.00000